In [1]:
import numpy as np

In [2]:
import pandas as pd

In [3]:
string_data = pd.Series(['aardvard','artichoke',np.nan,'avocado'])

In [4]:
string_data

0     aardvard
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1,NA,3.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7,3))

In [21]:
df.iloc[:4,1] = NA

In [22]:
df.iloc[:2,2] = NA

In [23]:
df

          0         1         2
0 -0.777113       NaN       NaN
1 -0.410381       NaN       NaN
2 -0.883076       NaN  0.945465
3 -2.109474       NaN -0.436344
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [24]:
df.dropna()

          0         1         2
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [25]:
df.dropna(thresh = 2)

          0         1         2
2 -0.883076       NaN  0.945465
3 -2.109474       NaN -0.436344
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [26]:
df.fillna(0)

          0         1         2
0 -0.777113  0.000000  0.000000
1 -0.410381  0.000000  0.000000
2 -0.883076  0.000000  0.945465
3 -2.109474  0.000000 -0.436344
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [27]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.777113  0.500000  0.000000
1 -0.410381  0.500000  0.000000
2 -0.883076  0.500000  0.945465
3 -2.109474  0.500000 -0.436344
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [28]:
_ = df.fillna(0, inplace=True)

In [29]:
df

          0         1         2
0 -0.777113  0.000000  0.000000
1 -0.410381  0.000000  0.000000
2 -0.883076  0.000000  0.945465
3 -2.109474  0.000000 -0.436344
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [30]:
df

          0         1         2
0 -0.777113  0.000000  0.000000
1 -0.410381  0.000000  0.000000
2 -0.883076  0.000000  0.945465
3 -2.109474  0.000000 -0.436344
4  0.417671  1.193612 -1.491692
5 -0.330640  0.854702  0.961611
6 -0.261435  1.190402 -1.186490

In [31]:
df = pd.DataFrame(np.random.randn(6,3))

In [32]:
df.iloc[2:,1] = NA

In [33]:
df.iloc[4:,2] = NA

In [34]:
df

          0         1         2
0 -0.972075 -0.758522  2.729305
1  0.231648 -0.049321  0.309514
2 -0.657545       NaN -1.253906
3  0.032612       NaN -0.489353
4 -0.017849       NaN       NaN
5  0.624061       NaN       NaN

In [35]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.972075 -0.758522  2.729305
1  0.231648 -0.049321  0.309514
2 -0.657545 -0.049321 -1.253906
3  0.032612 -0.049321 -0.489353
4 -0.017849 -0.049321 -0.489353
5  0.624061 -0.049321 -0.489353

In [36]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.972075 -0.758522  2.729305
1  0.231648 -0.049321  0.309514
2 -0.657545 -0.049321 -1.253906
3  0.032612 -0.049321 -0.489353
4 -0.017849       NaN -0.489353
5  0.624061       NaN -0.489353

In [37]:
data = pd.Series([1.,NA,3.5,NA,7])

In [38]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [39]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})

In [40]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [41]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [42]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [43]:
data['v1'] = range(7)

In [44]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [45]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [46]:
data = pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef','Bacon','pastrami','honey ham','nova lox'],
                    'ounces':[4,3,12,6,7.5,8,3,5,6]})

In [47]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [48]:
meat_to_animal = {
    'bacon':'pig',
    'pilled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [49]:
lowercased = data['food'].str.lower()

In [50]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [51]:
data['animal'] = lowercased.map(meat_to_animal)

In [52]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     NaN
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [53]:
data = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

In [54]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [55]:
data.replace(-999,NA)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [57]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [58]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [59]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),index = ['Ohio','Colorado','New York'],columns=['one','two','three','four'])

In [60]:
transform = lambda x: x[:4].upper()

In [61]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [62]:
data.index = data.index.map(transform)

In [63]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [64]:
data = np.random.randn(1000)

In [65]:
cats = pd.qcut(data,4)

In [66]:
cats

[(-3.389, -0.681], (-0.681, -0.00665], (-0.00665, 0.694], (-0.00665, 0.694], (-0.681, -0.00665], ..., (0.694, 3.425], (-3.389, -0.681], (-0.681, -0.00665], (0.694, 3.425], (-0.681, -0.00665]]
Length: 1000
Categories (4, interval[float64]): [(-3.389, -0.681] < (-0.681, -0.00665] < (-0.00665, 0.694] < (0.694, 3.425]]

In [67]:
pd.value_counts(cats)

(0.694, 3.425]        250
(-0.00665, 0.694]     250
(-0.681, -0.00665]    250
(-3.389, -0.681]      250
dtype: int64

In [68]:
pd.qcut(data,[0,0.1,0.5,0.9,1.])

[(-1.29, -0.00665], (-1.29, -0.00665], (-0.00665, 1.208], (-0.00665, 1.208], (-1.29, -0.00665], ..., (-0.00665, 1.208], (-3.389, -1.29], (-1.29, -0.00665], (1.208, 3.425], (-1.29, -0.00665]]
Length: 1000
Categories (4, interval[float64]): [(-3.389, -1.29] < (-1.29, -0.00665] < (-0.00665, 1.208] < (1.208, 3.425]]

In [69]:
data = pd.DataFrame(np.random.randn(1000,4))

In [70]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.004087    -0.042874     0.046801     0.004354
std       1.004087     0.999460     1.001752     0.973028
min      -3.133731    -3.020372    -3.336987    -2.893077
25%      -0.711467    -0.720350    -0.663998    -0.641662
50%       0.070775    -0.025209     0.034115    -0.010467
75%       0.684340     0.627100     0.691625     0.691634
max       2.707239     2.885305     4.069377     2.899377

In [71]:
col = data[2]

In [72]:
col[np.abs(col) > 3]

691   -3.105263
749   -3.254463
786   -3.336987
815    4.069377
Name: 2, dtype: float64

In [73]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
459 -3.133731 -0.152645 -1.837739 -1.563780
691  0.845733  0.228023 -3.105263 -0.468863
749 -0.847649 -0.001823 -3.254463 -1.480318
786  0.323834  0.487302 -3.336987  0.783771
815 -1.753808 -2.136363  4.069377 -0.750594
980  0.490882 -3.020372  0.372903  1.008298

In [74]:
data[np.abs(data) > 3] = np.sign(data)*3

In [75]:
data.describe

<bound method NDFrame.describe of             0         1         2         3
0    2.316245  1.084112 -0.854843 -0.108303
1    0.557178 -0.356775 -0.960863 -0.257670
2    1.183830 -0.177610 -0.599146  0.450758
3   -0.097048  0.449508  0.007323 -0.931857
4    0.297080 -1.922880  0.988330  0.022686
5   -1.462091  0.605848  0.567225  0.000749
6   -0.214570  0.682048  0.603665  0.382205
7    0.731720 -1.069075 -1.716114  0.650831
8    0.819510 -0.324658 -0.691253 -2.019831
9    1.681288  0.252626 -0.617411 -0.655543
10  -0.227152  0.459691 -1.441965  1.522232
11   2.125443 -0.145186  0.311763  1.036526
12  -0.492861  0.266720 -0.575911 -1.197433
13   1.495929 -0.059183  1.863423 -1.190133
14  -0.085675 -2.136860  0.600860  0.781775
15  -0.148515 -0.064068  1.803449  0.023244
16  -1.913577  0.652222 -0.662737  1.304773
17  -0.721077  0.622080 -0.410963  0.263121
18  -2.264561 -1.698838 -1.376187 -1.056330
19   2.111468  0.244620  0.054393  1.003296
20  -0.107946  0.624533 -0.711660 -0.343624
21   0.781655  0.856802  0.550455  0.398275
22  -1.101962  1.061107  0.879096 -0.731685
23   0.503133  1.309430  0.872449 -0.444813
24  -0.463424 -0.282768  0.227677 -0.063681
25   0.062098 -0.753220 -1.071748  1.038604
26  -1.174618  1.203598 -1.978798 -1.914279
27   0.574228  1.334117 -0.247040  1.166802
28   1.958621  0.236112 -1.190658 -2.045095
29  -1.797309 -0.575469 -1.151624  0.647830
..        ...       ...       ...       ...
970 -1.378532  0.089065  0.156679 -0.043227
971 -1.034649  1.572304  0.030603  2.340316
972  1.015559  0.363757 -0.122301  1.967494
973 -0.008337  0.518897  2.482460  1.429841
974 -0.210989  0.693036  0.611423  1.027908
975  0.451728  0.087227  0.398907  1.201101
976  0.616655  0.816487  1.144059  1.929085
977  1.971989  1.797127 -0.275273  0.040546
978 -0.542916 -1.014739  2.053740  1.002003
979 -0.675801 -0.103744  0.763086  0.468560
980  0.490882 -3.000000  0.372903  1.008298
981  0.039630  0.985554 -0.765371 -0.523692
982  1.777058  1.628417 -0.926838  0.442262
983  0.355788  1.686943  0.634409  0.239171
984 -0.020910 -0.600907 -0.815376 -0.433491
985  0.939372 -1.273102  0.893103 -0.919531
986  0.558135 -1.365516 -0.036428  0.315415
987 -0.388792  1.374876  0.120371 -0.865978
988  0.305868 -0.770413  1.523047 -0.057322
989  1.380945 -0.803698 -0.556190  0.034117
990 -1.960284  0.299001  1.097999  0.006774
991  0.508134  1.067722  0.219925  0.287800
992 -0.921659  0.311720 -0.436820  1.321705
993 -0.838346 -1.006318 -1.045368 -1.813347
994  0.564807 -0.380264 -2.437891  1.119722
995 -1.023655 -2.155199 -0.283487 -0.641060
996 -2.367118 -0.572343 -0.020302  1.035210
997  0.045686 -0.868078  0.164901 -0.755825
998  0.632409 -1.553979 -1.289262 -1.445204
999 -0.889745  0.977103  0.342296  0.782749

[1000 rows x 4 columns]>

In [76]:
df = pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [77]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [78]:
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [79]:
val = 'a,b,  guido'

In [80]:
val.split(',')

['a', 'b', '  guido']

In [81]:
pieces = [x.strip() for x in val.split(',')]

In [82]:
pieces

['a', 'b', 'guido']

In [83]:
first, second, third = pieces

In [84]:
first + '::' + second + '::' +third

'a::b::guido'

In [85]:
'::'.join(pieces)

'a::b::guido'

In [86]:
'guido' in val

True

In [87]:
val.index(',')

1

In [88]:
val.find(':')

-1

In [89]:
val.index(':')

ValueError: substring not found

In [90]:
val.count(',')

2

In [91]:
val.replace(',','::')

'a::b::  guido'

In [92]:
val.replace(',','')

'ab  guido'

In [93]:
import re

In [94]:
text = "foo   bar\t baz  \tqux"

In [95]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [96]:
regex = re.compile('\s+')

In [97]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [98]:
regex.findall(text)

['   ', '\t ', '  \t']

In [99]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

In [100]:
pattern = r'[A-Z0-9.-%+-]+@[A-Z0-9.-]+\.[a-Z]{2,4}'

In [102]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[a-Z]{2,4}'

In [104]:
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [105]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [106]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [107]:
m = regex.search(text)

In [108]:
m

In [109]:
text[m.start():m.end()]

'dave@google.com'

In [110]:
print(regex.match(text))

None

In [111]:
print(regex.sub('REDACTED',text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [112]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

SyntaxError: EOL while scanning string literal (<ipython-input-112-e1f5a52cb265>, line 1)

In [113]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})''

SyntaxError: EOL while scanning string literal (<ipython-input-113-cdb936382541>, line 1)

In [114]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [115]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [116]:
m = regex.match('wesm@bright.net')

In [117]:
m.groups()

('wesm', 'bright', 'net')

In [118]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [119]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [120]:
print(r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+).([A-Z]{2,4})')

([A-Z0-9._%+-]+)@([A-Z0-9.-]+).([A-Z]{2,4})

In [121]:
print(r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})')

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

In [122]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+).([A-Z]{2,4})'

In [123]:
regex = re.compile(pattern, flags = re.IGNORECASE)

In [124]:
m = regex.match('wesm@bright.net')

In [125]:
m.groups()

('wesm', 'bright.', 'et')

In [126]:
data = {'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [127]:
data = pd.Series(data)

In [128]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [129]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [130]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [131]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+).([A-Z]{2,4})'

In [132]:
print(r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})')

([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})

In [133]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [135]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [136]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [137]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [138]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [139]:
matches.str.get(1)

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [140]:
matches.str[0]

Dave    NaN
Steve   NaN
Rob     NaN
Wes     NaN
dtype: float64

In [141]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object